{
  "main": {
    "name":"Jimmy Njuguna",
    "description":"Full-Stack Software Engineer | B.S. in Computer Science from University of Virginia",
    "image":"profilepic.jpg",
    "bio":"I'm a full-stack software engineer with a Computer Science degree from the University of Virginia and two years of professional experience at Amazon, where I focused on full-stack architecture across supply chain, sustainability, and collaboration tools. Today, I manage the web application at SimpleSUB Water, a mission-driven startup building tools to support water conservation and sustainable infrastructure.\n\nMy background as a military kid and global traveler—having lived or spent time across North America, Europe, Africa, Asia, and Australia—shapes how I think, build, and collaborate. I bring a global mindset, a strong sense of inclusion, and a bias for action to every project I take on.\n\nOutside of code, I’ve led peer mentoring groups, taught programming as a Head Teaching Assistant, and built communities as a resident advisor. Whether it's building scalable platforms, leading UI redesigns, or just shipping clean code that makes someone's day easier, I’m here to solve meaningful problems with creativity, empathy, and impact.\n\n",
    "contactmessage":"Whether you’re building something impactful, looking for a creative collaborator, or just want to chat tech, design, or sustainability—I’m always open to a good conversation. Reach out and let’s talk.\n\n",
    "email": "jimmyn883@gmail.com",
    "address":{
      "city":"Denver",
      "state":"Colorado",
      "zip": "80211"
    },
    "website": "jimmyn883.github.io",
    "resumedownload":"https://drive.google.com/file/d/1o_7qz8UU5bUorfyMWw6X4e_TH5_gDbIS/view?usp=drive_link",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/jimmynjuguna/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/jimmyn883",
        "className":"fa fa-github"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Nezuko Graphical Drawing",
        "category":"Creative coding",
        "image":"nezuko.jpg",
        "url":"https://github.com/jimmyn883/nezuko_drawing/blob/main/drawing.py"
      },
      {
        "title": "Duper Brawler Siblings",
        "category": "Creative coding",
        "image": "DuperBrawlerSiblings.jpg",
        "url":"https://uvacs.games/"
      }
    ]
  }
}
